export const classStats = {
    knight: {
        name: "อัศวิน",
        img: "image/knight.png", // <-- เพิ่มบรรทัดนี้
        hp: 150,
        maxHp: 150,
        str: 10,
        int: 2,
        agi: 5,
        desc: "ผู้กล้าที่แข็งแกร่งและถึกทน"
    },
    mage: {
        name: "นักเวทย์",
        img: "image/mage.png", // <-- เพิ่มบรรทัดนี้
        hp: 80,
        maxHp: 80,
        str: 3,
        int: 12,
        agi: 4,
        desc: "ผู้ใช้มนตรา พลังทำลายล้างสูงแต่ตัวบาง"
    },
    rogue: {
        name: "โจร",
        img: "image/rogue.png", // <-- เพิ่มบรรทัดนี้
        hp: 100,
        maxHp: 100,
        str: 6,
        int: 4,
        agi: 10,
        desc: "นักลอบสังหาร ว่องไวและแม่นยำ"
    }
};

export const items = {
    potion_s: {
        id: "potion_s",
        name: "ยาแดงขวดเล็ก",
        icon: "🍷",
        desc: "ฟื้นฟูเลือด 30 หน่วย",
        type: "consumable",
        effect: { hp: 30 }
    },
    potion_l: {
        id: "potion_l",
        name: "ยาแดงขวดใหญ่",
        icon: "🏺",
        desc: "ฟื้นฟูเลือด 100 หน่วย",
        type: "consumable",
        effect: { hp: 100 }
    },
    elixir: {
        id: "elixir",
        name: "ยาเพิ่มพลัง",
        icon: "🧪",
        desc: "เพิ่ม STR ถาวร +1",
        type: "consumable",
        effect: { str: 1 }
    }
};